# MEPConnectorInfo Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPConnectorInfo Class
Members See Also
---
MEP connector information.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class MEPConnectorInfo : IDisposable
```

Visual Basic
---
```text
Public Class MEPConnectorInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class MEPConnectorInfo : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..MEPConnectorInfo Autodesk.Revit.DB..::..MEPFamilyConnectorInfo
# See Also
MEPConnectorInfo Members
Autodesk.Revit.DB Namespace